# EGOC_Token ICO
Join ICO Now: https://egoblockchain.com/ico/
Token name : EGOCOIN
Symbol: EGOC
Max supply : 100.000.000 EGOC
Total supply: 100.000.000 EGOC
Specification : ERC-20 
The end of crowd sale will be: 
1 ETH - 22.500 EGOC
1 ETH ~ 1300$ 
1 EGOC ~ 0.06$
Decimal: 8
Soft cap/hard cap (pre sales) - 80ETH/400ETH
Soft cap/hard cap (crowd sale) - 400 ETH/800 ETH

Distribution tokens 
20% to the pre sale  
20% to the crowd sale 
10% to the marketing and fees
10% to the founder, developers.
40% to the EGOC ecosystem. 

 For every sale the EGOC/ ETH price will be decreased for ~20% from the beginning of the first pre sale until the end of the crowd sale. 

We will create two pre sales and one crowd sale. Each pre sale will sell 10M EGOC with different EGOC/ETH .The crowd sale will sell 20M EGOC in a different EGOC/ETH also. 

The first pre sale will start in 3 days after deployment and runs for 30 days, then starts the second pre sale also for 30 days and after that the crowd sale will start and it will run for 60 days. 

Refund Route -EGOC tokens with guarantee

Investors can choose to buy EGOC tokens with guarantee.

refund route rates are 50% of the regular rate (starting from the first pre sale from 55.000 EGOC for 1 ETH at the first day and ending at 22.500 EGOC for 1 ETH at the last day of the crowd sale).

EGOC tokens and the ETH funds are deposited to a RefundVault contract owned by the crowdsale contract.

Investors bought EGOCs on the refund route can get refund of their ETH or claim their EGOC tokens only after the crowd sale ends.

Refund ETH period is limited to 30 days after the crowd sale ends. EGOC token claim is not limited in time.

Any of the actions (refund ETH and EGOC token claim) can be executed by the investor directly on the RefundVault contract.

Any of the actions (refund ETH and EGOC token claim) can be done on parts of the amount.

In case of refund ETH, the proportional amount of EGOC tokens will be burned.
In case of EGOC token claim, the proportional amount of ETH will be transferred to EGOC ETH Wallet.
In Case of partial action the remaining ETH and EGOC tokens will be available to more refund or claim actions according to the refund period and updated amounts.
